lib/active_shipping/shipping/carriers/fedex/templates/tracking.xml.erb

<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns='http://fedex.com/ws/track/v8'>
  <soapenv:Header/>
  <soapenv:Body>
    <TrackRequest>
      <WebAuthenticationDetail>
        <UserCredential>
          <Key><%= @key %></Key>
          <Password><%= @password %></Password>
        </UserCredential>
      </WebAuthenticationDetail>
      <ClientDetail>
        <AccountNumber><%= @accountNumber %></AccountNumber>
        <MeterNumber><%= @meterNumber %></MeterNumber>
      </ClientDetail>
      <Version>
        <ServiceId>trck</ServiceId>
        <Major>8</Major>
        <Intermediate>0</Intermediate>
        <Minor>0</Minor>
      </Version>
      <SelectionDetails>
        <CarrierCode>FDXE</CarrierCode>
        <PackageIdentifier>
          <Type>TRACKING_NUMBER_OR_DOORTAG</Type>
          <Value><%= @trackingnumber %></Value>
        </PackageIdentifier>
      </SelectionDetails>
      <ProcessingOptions>INCLUDE_DETAILED_SCANS</ProcessingOptions>
    </TrackRequest>
  </soapenv:Body>
</soapenv:Envelope>    